Revit 2027 API
FabricArea.DirectionOrigin Property
 The Origin Point of the Major Direction of the Fabric Area.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ DirectionOrigin { get; }
Public ReadOnly Property DirectionOrigin As XYZ
	Get
public:
property XYZ^ DirectionOrigin {
	XYZ^ get ();
}
member DirectionOrigin : XYZ with get
Property Value
XYZ
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace